#include <stdio.h>
//2주차 2장 실습 과제(pp.100-101). 2023-03-09. 
//지금까지 계속 한 파일을 열어서 코딩하고 실행만 해 보는 용도로 써서
// <- 03.30일날 교수님한테 물어봐서 파일을 만든 날짜로 확인한다는 것을 알았고
//교수님이 우선 이유를 적어두라고 하셔서...지금 구글 독스에서 다시 여기에 옮깁니다ㅠㅜ
int main(void)
{
	//0---------------------
	printf("Hello world!\n");

	
	//1---------------------
	printf("C Pascal Java Python Kotlin\n");


	//2-------------------
	printf("C\nPascal\nJava\nPython\nKotlin\n");


	//3-------------------
	puts("데니스 리치, 제임스 고슬링, 귀도 반 로섬");


	//4-------------------
	printf("프로그램 개발 과정\n\n");
	printf("1. 프로젝트 작성\n2. 소스 작성\n");
	puts("3. 빌드");
	puts("4. 실행");


	//5------------------
	printf("*\n**\n***\n****\n");
	return 0;

}
